import random
import os

def gamer_choice():

        
    print('''\t\t\tEnter your choice \n
                        1 - \033[90m🪨    ROCK     🪨\033[0m
                        2 - \033[97m📄   PAPER     📄\033[0m
                        3 - \033[35m✂️    SCISSORS   ✂️\033[0m
                        \n\t\t''')
    
    try:
        choice = int(input('\t\t').strip())
        
    except ValueError:
        return False

    if choice > 3:
        return False
        
    match choice:    
        case 1:
            return ('\t\t\t\033[90m🪨    ROCK     🪨\033[0m',1)
        case 2:
            return ('\t\t\t\033[97m📄   PAPER     📄\033[0m',2)
        case 3:
            return ('\t\t\t\033[35m✂️    SCISSORS   ✂️\033[0m',3)
        case _:
            raise RuntimeError("AI generated invalid choice")

        
def ai_choice() -> list[str,int]:
    
    choice = random.randint(1,3)

    match choice:

        case 1:
            return ('\t\t\t\033[90m🪨    ROCK     🪨\033[0m',1)
        case 2:
            return ('\t\t\t\033[97m📄   PAPER     📄\033',2)
        case 3:
            return ('\t\t\t\033[35m✂️    SCISSORS   ✂️\033[0m',3)
        case _:
            raise RuntimeError("AI generated invalid choice")
        
while True:

    print(''' \033[34m
          

    ██████╗░░█████╗░░█████╗░██╗░░██╗  ██████╗░░█████╗░██████╗░███████╗██████╗░
    ██╔══██╗██╔══██╗██╔══██╗██║░██╔╝  ██╔══██╗██╔══██╗██╔══██╗██╔════╝██╔══██╗
    ██████╔╝██║░░██║██║░░╚═╝█████═╝░  ██████╔╝███████║██████╔╝█████╗░░██████╔╝
    ██╔══██╗██║░░██║██║░░██╗██╔═██╗░  ██╔═══╝░██╔══██║██╔═══╝░██╔══╝░░██╔══██╗
    ██║░░██║╚█████╔╝╚█████╔╝██║░╚██╗  ██║░░░░░██║░░██║██║░░░░░███████╗██║░░██║
    ╚═╝░░╚═╝░╚════╝░░╚════╝░╚═╝░░╚═╝  ╚═╝░░░░░╚═╝░░╚═╝╚═╝░░░░░╚══════╝╚═╝░░╚═╝

    ░██████╗░█████╗░██╗░██████╗░██████╗░█████╗░██████╗░░██████╗
    ██╔════╝██╔══██╗██║██╔════╝██╔════╝██╔══██╗██╔══██╗██╔════╝
    ╚█████╗░██║░░╚═╝██║╚█████╗░╚█████╗░██║░░██║██████╔╝╚█████╗░
    ░╚═══██╗██║░░██╗██║░╚═══██╗░╚═══██╗██║░░██║██╔══██╗░╚═══██╗
    ██████╔╝╚█████╔╝██║██████╔╝██████╔╝╚█████╔╝██║░░██║██████╔╝
    ╚═════╝░░╚════╝░╚═╝╚═════╝░╚═════╝░░╚════╝░╚═╝░░╚═╝╚═════╝░

    \033[0m''')

    choice = gamer_choice()
    aichoice = ai_choice()

    if not choice:
        print('\t\t\tInput must be a number (1-3)\n\n')
        os.system('pause')
        os.system('cls')
        continue

    print (choice[0])
    print(aichoice[0])

    if choice[1] == aichoice[1]:

        print('\n\n\t\t\t\33[97m  Draw \33[0m \n\n')

    elif (choice[1] == 1 and aichoice[1] == 2 ) or (choice[1] == 2 and aichoice[1] == 3) or (choice[1] == 3 and aichoice[1] == 1):
        print('\n\n\t\t\t\33[31m  Sorry , You lost \33[0m \n\n')
    else:
        print('\n\n\t\t\t\033[32m You Are the Winner \033[0m\n\n')

    os.system('pause')
    os.system('cls')
    continue



